[Timeout] BlockStatement
src/bf_interpreter.js:2:19
 // Brainfuck memory is expected to be able to under- and overflow.
-function as_u8(n) {
-    if (n === undefined) throw new Error("Undefined value, likely due to out-of-bounds read."); // I hate JS
-    return n & 255;
-}
+function as_u8(n) {}
 
 // Used to print the current tape state (for debug purposes)

[Killed] ConditionalExpression
src/bf_interpreter.js:3:9
 // Brainfuck memory is expected to be able to under- and overflow.
 function as_u8(n) {
-    if (n === undefined) throw new Error("Undefined value, likely due to out-of-bounds read."); // I hate JS
+    if (true) throw new Error("Undefined value, likely due to out-of-bounds read."); // I hate JS
     return n & 255;
 }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] EqualityOperator
src/bf_interpreter.js:3:9
 // Brainfuck memory is expected to be able to under- and overflow.
 function as_u8(n) {
-    if (n === undefined) throw new Error("Undefined value, likely due to out-of-bounds read."); // I hate JS
+    if (n !== undefined) throw new Error("Undefined value, likely due to out-of-bounds read."); // I hate JS
     return n & 255;
 }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✕ "undefined" should throw an error (4 ms)
    ✕ as_u8(-1) == 255 (2 ms)

[Killed] ConditionalExpression
src/bf_interpreter.js:19:9
 
 // Interpreter for Brainfuck, a famous esoteric programming language
 function interpret_bf(program, input="") {
-    if (typeof program != "string") { 
+    if (false) { 
         throw new Error("Program is not a string.")
     }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] EqualityOperator
src/bf_interpreter.js:19:9
 
 // Interpreter for Brainfuck, a famous esoteric programming language
 function interpret_bf(program, input="") {
-    if (typeof program != "string") { 
+    if (typeof program == "string") { 
         throw new Error("Program is not a string.")
     }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8
    ✓ "undefined" should throw an error (29 ms)

[Killed] ConditionalExpression
src/bf_interpreter.js:29:34
     output = "";
     loop_stack = [];
     skip_until_brackets = 0;
-    for(let program_pointer = 0; program_pointer < program.length; program_pointer++) {
+    for(let program_pointer = 0; false; program_pointer++) {
         if (skip_until_brackets <= 0) {
             switch (program[program_pointer]) {
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Timeout] EqualityOperator
src/bf_interpreter.js:29:34
     output = "";
     loop_stack = [];
     skip_until_brackets = 0;
-    for(let program_pointer = 0; program_pointer < program.length; program_pointer++) {
+    for(let program_pointer = 0; program_pointer >= program.length; program_pointer++) {
         if (skip_until_brackets <= 0) {
             switch (program[program_pointer]) {

[Killed] EqualityOperator
src/bf_interpreter.js:30:13
     loop_stack = [];
     skip_until_brackets = 0;
     for(let program_pointer = 0; program_pointer < program.length; program_pointer++) {
-        if (skip_until_brackets <= 0) {
+        if (skip_until_brackets < 0) {
             switch (program[program_pointer]) {
                 case "+":
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] EqualityOperator
src/bf_interpreter.js:30:13
     loop_stack = [];
     skip_until_brackets = 0;
     for(let program_pointer = 0; program_pointer < program.length; program_pointer++) {
-        if (skip_until_brackets <= 0) {
+        if (skip_until_brackets > 0) {
             switch (program[program_pointer]) {
                 case "+":
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Timeout] ConditionalExpression
src/bf_interpreter.js:32:17
     for(let program_pointer = 0; program_pointer < program.length; program_pointer++) {
         if (skip_until_brackets <= 0) {
             switch (program[program_pointer]) {
-                case "+":
-                    tape[tape_pointer] = as_u8(tape[tape_pointer] + 1);
-                    break;
+                case "+":
                 case "-":
                     tape[tape_pointer] = as_u8(tape[tape_pointer] - 1);

[Timeout] ArithmeticOperator
src/bf_interpreter.js:33:48
         if (skip_until_brackets <= 0) {
             switch (program[program_pointer]) {
                 case "+":
-                    tape[tape_pointer] = as_u8(tape[tape_pointer] + 1);
+                    tape[tape_pointer] = as_u8(tape[tape_pointer] - 1);
                     break;
                 case "-":

[Timeout] ConditionalExpression
src/bf_interpreter.js:35:17
                 case "+":
                     tape[tape_pointer] = as_u8(tape[tape_pointer] + 1);
                     break;
-                case "-":
-                    tape[tape_pointer] = as_u8(tape[tape_pointer] - 1);
-                    break;
+                case "-":
                 case ">":
                     tape_pointer++;

[Timeout] ArithmeticOperator
src/bf_interpreter.js:36:48
                     tape[tape_pointer] = as_u8(tape[tape_pointer] + 1);
                     break;
                 case "-":
-                    tape[tape_pointer] = as_u8(tape[tape_pointer] - 1);
+                    tape[tape_pointer] = as_u8(tape[tape_pointer] + 1);
                     break;
                 case ">":

[Timeout] ConditionalExpression
src/bf_interpreter.js:38:17
                 case "-":
                     tape[tape_pointer] = as_u8(tape[tape_pointer] - 1);
                     break;
-                case ">":
-                    tape_pointer++;
-                    if (tape_pointer >= tape.length) {
-                        tape.push(0)
-                    }
-                    break;
+                case ">":
                 case "<":
                     tape_pointer--;

[Timeout] StringLiteral
src/bf_interpreter.js:38:22
                 case "-":
                     tape[tape_pointer] = as_u8(tape[tape_pointer] - 1);
                     break;
-                case ">":
+                case "":
                     tape_pointer++;
                     if (tape_pointer >= tape.length) {

[Timeout] UpdateOperator
src/bf_interpreter.js:39:21
                     tape[tape_pointer] = as_u8(tape[tape_pointer] - 1);
                     break;
                 case ">":
-                    tape_pointer++;
+                    tape_pointer--;
                     if (tape_pointer >= tape.length) {
                         tape.push(0)

[Killed] EqualityOperator
src/bf_interpreter.js:40:25
                     break;
                 case ">":
                     tape_pointer++;
-                    if (tape_pointer >= tape.length) {
+                    if (tape_pointer > tape.length) {
                         tape.push(0)
                     }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] BlockStatement
src/bf_interpreter.js:40:54
                     break;
                 case ">":
                     tape_pointer++;
-                    if (tape_pointer >= tape.length) {
-                        tape.push(0)
-                    }
+                    if (tape_pointer >= tape.length) {}
                     break;
                 case "<":
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Timeout] ConditionalExpression
src/bf_interpreter.js:44:17
                         tape.push(0)
                     }
                     break;
-                case "<":
-                    tape_pointer--;
-                    if (tape_pointer < 0) {
-                        tape.unshift(0);
-                        tape_pointer = 0;
-                    }
-                    break;
+                case "<":
                 case ",":
                     if (input_pointer >= input.length) {

[Timeout] UpdateOperator
src/bf_interpreter.js:45:21
                     }
                     break;
                 case "<":
-                    tape_pointer--;
+                    tape_pointer++;
                     if (tape_pointer < 0) {
                         tape.unshift(0);

[Timeout] BlockStatement
src/bf_interpreter.js:46:43
                     break;
                 case "<":
                     tape_pointer--;
-                    if (tape_pointer < 0) {
-                        tape.unshift(0);
-                        tape_pointer = 0;
-                    }
+                    if (tape_pointer < 0) {}
                     break;
                 case ",":

[Timeout] EqualityOperator
src/bf_interpreter.js:46:25
                     break;
                 case "<":
                     tape_pointer--;
-                    if (tape_pointer < 0) {
+                    if (tape_pointer >= 0) {
                         tape.unshift(0);
                         tape_pointer = 0;

[Killed] ConditionalExpression
src/bf_interpreter.js:51:17
                         tape_pointer = 0;
                     }
                     break;
-                case ",":
-                    if (input_pointer >= input.length) {
-                        tape[tape_pointer] = 0; // Return 0 for EOF
-                    } else {
-                        tape[tape_pointer] = as_u8(input.codePointAt(input_pointer));
-                        input_pointer++;
-                    }
-                    break;
+                case ",":
                 case ".":
                     output += String.fromCodePoint(tape[tape_pointer]);
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] StringLiteral
src/bf_interpreter.js:51:22
                         tape_pointer = 0;
                     }
                     break;
-                case ",":
+                case "":
                     if (input_pointer >= input.length) {
                         tape[tape_pointer] = 0; // Return 0 for EOF
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] BlockStatement
src/bf_interpreter.js:52:56
                     }
                     break;
                 case ",":
-                    if (input_pointer >= input.length) {
-                        tape[tape_pointer] = 0; // Return 0 for EOF
-                    } else {
+                    if (input_pointer >= input.length) {} else {
                         tape[tape_pointer] = as_u8(input.codePointAt(input_pointer));
                         input_pointer++;
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✓ "undefined" should throw an error (38 ms)
    ✓ as_u8(-1) == 255

[Killed] ConditionalExpression
src/bf_interpreter.js:52:25
                     }
                     break;
                 case ",":
-                    if (input_pointer >= input.length) {
+                    if (false) {
                         tape[tape_pointer] = 0; // Return 0 for EOF
                     } else {
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] BlockStatement
src/bf_interpreter.js:54:28
                 case ",":
                     if (input_pointer >= input.length) {
                         tape[tape_pointer] = 0; // Return 0 for EOF
-                    } else {
-                        tape[tape_pointer] = as_u8(input.codePointAt(input_pointer));
-                        input_pointer++;
-                    }
+                    } else {}
                     break;
                 case ".":
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] UpdateOperator
src/bf_interpreter.js:56:25
                         tape[tape_pointer] = 0; // Return 0 for EOF
                     } else {
                         tape[tape_pointer] = as_u8(input.codePointAt(input_pointer));
-                        input_pointer++;
+                        input_pointer--;
                     }
                     break;
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8
    ✓ "undefined" should throw an error (37 ms)

[Killed] ConditionalExpression
src/bf_interpreter.js:59:17
                         input_pointer++;
                     }
                     break;
-                case ".":
-                    output += String.fromCodePoint(tape[tape_pointer]);
-                    //console.log(output.at(-1)+" ("+tape[tape_pointer]+") "+tape);
-                    break;
+                case ".":
                 case "[":
                     if (tape[tape_pointer] === 0) {
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✓ "undefined" should throw an error (31 ms)
    ✓ as_u8(-1) == 255 (1 ms)

[Killed] StringLiteral
src/bf_interpreter.js:59:22
                         input_pointer++;
                     }
                     break;
-                case ".":
+                case "":
                     output += String.fromCodePoint(tape[tape_pointer]);
                     //console.log(output.at(-1)+" ("+tape[tape_pointer]+") "+tape);
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] AssignmentOperator
src/bf_interpreter.js:60:21
                     }
                     break;
                 case ".":
-                    output += String.fromCodePoint(tape[tape_pointer]);
+                    output -= String.fromCodePoint(tape[tape_pointer]);
                     //console.log(output.at(-1)+" ("+tape[tape_pointer]+") "+tape);
                     break;
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✓ "undefined" should throw an error (42 ms)
    ✓ as_u8(-1) == 255

[Killed] ConditionalExpression
src/bf_interpreter.js:63:17
                     output += String.fromCodePoint(tape[tape_pointer]);
                     //console.log(output.at(-1)+" ("+tape[tape_pointer]+") "+tape);
                     break;
-                case "[":
-                    if (tape[tape_pointer] === 0) {
-                        skip_until_brackets++;
-                    } else {
-                        loop_stack.push(program_pointer);
-                    }
-                    break;
+                case "[":
                 case "]":
                     if(loop_stack.length) {
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✓ "undefined" should throw an error (36 ms)
    ✓ as_u8(-1) == 255 (1 ms)

[Killed] ConditionalExpression
src/bf_interpreter.js:64:25
                     //console.log(output.at(-1)+" ("+tape[tape_pointer]+") "+tape);
                     break;
                 case "[":
-                    if (tape[tape_pointer] === 0) {
+                    if (true) {
                         skip_until_brackets++;
                     } else {
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8

    ✓ "undefined" should throw an error (41 ms)

[Timeout] ConditionalExpression
src/bf_interpreter.js:64:25
                     //console.log(output.at(-1)+" ("+tape[tape_pointer]+") "+tape);
                     break;
                 case "[":
-                    if (tape[tape_pointer] === 0) {
+                    if (false) {
                         skip_until_brackets++;
                     } else {

[Timeout] UpdateOperator
src/bf_interpreter.js:65:25
                     break;
                 case "[":
                     if (tape[tape_pointer] === 0) {
-                        skip_until_brackets++;
+                        skip_until_brackets--;
                     } else {
                         loop_stack.push(program_pointer);

[Killed] BlockStatement
src/bf_interpreter.js:66:28
                 case "[":
                     if (tape[tape_pointer] === 0) {
                         skip_until_brackets++;
-                    } else {
-                        loop_stack.push(program_pointer);
-                    }
+                    } else {}
                     break;
                 case "]":
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8
    ✓ "undefined" should throw an error (33 ms)

[Killed] ConditionalExpression
src/bf_interpreter.js:70:17
                         loop_stack.push(program_pointer);
                     }
                     break;
-                case "]":
-                    if(loop_stack.length) {
-                        if (tape[tape_pointer] != 0) {
-                            program_pointer = loop_stack.at(-1); //bc of for loop, actually jumps to instruction AFTER "["
-                        } else {
-                            loop_stack.pop();
-                        }
-                    } else {
-                        throw new Error("Mismatched right bracket at character "+(program_pointer+1)+".");
-                    }
-                    break;
+                case "]":
+// everything else is a comment
                 // everything else is a comment
             }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] BlockStatement
src/bf_interpreter.js:71:43
                     }
                     break;
                 case "]":
-                    if(loop_stack.length) {
-                        if (tape[tape_pointer] != 0) {
-                            program_pointer = loop_stack.at(-1); //bc of for loop, actually jumps to instruction AFTER "["
-                        } else {
-                            loop_stack.pop();
-                        }
-                    } else {
+                    if(loop_stack.length) {} else {
                         throw new Error("Mismatched right bracket at character "+(program_pointer+1)+".");
                     }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✓ "undefined" should throw an error (34 ms)
    ✓ as_u8(-1) == 255 (1 ms)

[Killed] ConditionalExpression
src/bf_interpreter.js:71:24
                     }
                     break;
                 case "]":
-                    if(loop_stack.length) {
+                    if(false) {
                         if (tape[tape_pointer] != 0) {
                             program_pointer = loop_stack.at(-1); //bc of for loop, actually jumps to instruction AFTER "["
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✓ "undefined" should throw an error (29 ms)
    ✓ as_u8(-1) == 255

[Killed] ConditionalExpression
src/bf_interpreter.js:72:29
                     break;
                 case "]":
                     if(loop_stack.length) {
-                        if (tape[tape_pointer] != 0) {
+                        if (false) {
                             program_pointer = loop_stack.at(-1); //bc of for loop, actually jumps to instruction AFTER "["
                         } else {
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] BlockStatement
src/bf_interpreter.js:72:54
                     break;
                 case "]":
                     if(loop_stack.length) {
-                        if (tape[tape_pointer] != 0) {
-                            program_pointer = loop_stack.at(-1); //bc of for loop, actually jumps to instruction AFTER "["
-                        } else {
+                        if (tape[tape_pointer] != 0) {} else {
                             loop_stack.pop();
                         }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] UnaryOperator
src/bf_interpreter.js:73:61
                 case "]":
                     if(loop_stack.length) {
                         if (tape[tape_pointer] != 0) {
-                            program_pointer = loop_stack.at(-1); //bc of for loop, actually jumps to instruction AFTER "["
+                            program_pointer = loop_stack.at(+1); //bc of for loop, actually jumps to instruction AFTER "["
                         } else {
                             loop_stack.pop();
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Timeout] BlockStatement
src/bf_interpreter.js:74:32
                     if(loop_stack.length) {
                         if (tape[tape_pointer] != 0) {
                             program_pointer = loop_stack.at(-1); //bc of for loop, actually jumps to instruction AFTER "["
-                        } else {
-                            loop_stack.pop();
-                        }
+                        } else {}
                     } else {
                         throw new Error("Mismatched right bracket at character "+(program_pointer+1)+".");

[Killed] BlockStatement
src/bf_interpreter.js:77:28
                         } else {
                             loop_stack.pop();
                         }
-                    } else {
-                        throw new Error("Mismatched right bracket at character "+(program_pointer+1)+".");
-                    }
+                    } else {}
                     break;
                 // everything else is a comment
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8
    ✓ "undefined" should throw an error (28 ms)

[Killed] ArithmeticOperator
src/bf_interpreter.js:78:83
                             loop_stack.pop();
                         }
                     } else {
-                        throw new Error("Mismatched right bracket at character "+(program_pointer+1)+".");
+                        throw new Error("Mismatched right bracket at character "+(program_pointer - 1)+".");
                     }
                     break;
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] StringLiteral
src/bf_interpreter.js:78:102
                             loop_stack.pop();
                         }
                     } else {
-                        throw new Error("Mismatched right bracket at character "+(program_pointer+1)+".");
+                        throw new Error("Mismatched right bracket at character "+(program_pointer+1)+"");
                     }
                     break;
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✓ "undefined" should throw an error (31 ms)
    ✓ as_u8(-1) == 255 (1 ms)

[Killed] BlockStatement
src/bf_interpreter.js:83:16
                     break;
                 // everything else is a comment
             }
-        } else { // a while condition failed; skipping forward until matching bracket
-            switch (program[program_pointer]) {
-                case "[":
-                    skip_until_brackets++;
-                    break;
-                case "]":
-                    skip_until_brackets--;
-                    break;
-                // skip everything else
-            }
-        }
+        } else {}
     }
     return output;
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✓ "undefined" should throw an error (41 ms)
    ✓ as_u8(-1) == 255 (1 ms)

[Killed] ConditionalExpression
src/bf_interpreter.js:85:17
             }
         } else { // a while condition failed; skipping forward until matching bracket
             switch (program[program_pointer]) {
-                case "[":
-                    skip_until_brackets++;
-                    break;
+                case "[":
                 case "]":
                     skip_until_brackets--;
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] UpdateOperator
src/bf_interpreter.js:86:21
         } else { // a while condition failed; skipping forward until matching bracket
             switch (program[program_pointer]) {
                 case "[":
-                    skip_until_brackets++;
+                    skip_until_brackets--;
                     break;
                 case "]":
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] ConditionalExpression
src/bf_interpreter.js:88:17
                 case "[":
                     skip_until_brackets++;
                     break;
-                case "]":
-                    skip_until_brackets--;
-                    break;
+                case "]":
+// skip everything else
                 // skip everything else
             }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] StringLiteral
src/bf_interpreter.js:88:22
                 case "[":
                     skip_until_brackets++;
                     break;
-                case "]":
+                case "":
                     skip_until_brackets--;
                     break;
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  as_u8

[Killed] UpdateOperator
src/bf_interpreter.js:89:21
                     skip_until_brackets++;
                     break;
                 case "]":
-                    skip_until_brackets--;
+                    skip_until_brackets++;
                     break;
                 // skip everything else
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  as_u8
    ✓ "undefined" should throw an error (25 ms)
    ✓ as_u8(-1) == 255 (1 ms)
