[Timeout] BlockStatement
src/bf_interpreter.js:2:19
 // Brainfuck memory is expected to be able to under- and overflow.
-function as_u8(n) {
-    return n & 255; //no modulo operator Q_Q
-}
+function as_u8(n) {}
 
 // Used to print the current tape state (for debug purposes)

[Killed] ConditionalExpression
src/bf_interpreter.js:18:9
 
 // Interpreter for Brainfuck, a famous esoteric programming language
 function interpret_bf(program, input="") {
-    if (typeof program != "string") { 
+    if (true) { 
         throw new Error("Program is not a string.")
     }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  interpret_bf

[Killed] StringLiteral
src/bf_interpreter.js:25:14
     tape = [0];
     tape_pointer = 0;
     input_pointer = 0;
-    output = "";
+    output = "Stryker was here!";
     loop_stack = [];
     skip_until_brackets = 0;
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  interpret_bf

[Killed] ArrayDeclaration
src/bf_interpreter.js:26:18
     tape_pointer = 0;
     input_pointer = 0;
     output = "";
-    loop_stack = [];
+    loop_stack = ["Stryker was here"];
     skip_until_brackets = 0;
     for(let program_pointer = 0; program_pointer < program.length; program_pointer++) {
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  interpret_bf

[Killed] UpdateOperator
src/bf_interpreter.js:28:68
     output = "";
     loop_stack = [];
     skip_until_brackets = 0;
-    for(let program_pointer = 0; program_pointer < program.length; program_pointer++) {
+    for(let program_pointer = 0; program_pointer < program.length; program_pointer--) {
         if (skip_until_brackets <= 0) {
             switch (program[program_pointer]) {
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  interpret_bf

[Killed] ConditionalExpression
src/bf_interpreter.js:39:25
                     break;
                 case ">":
                     tape_pointer++;
-                    if (tape_pointer >= tape.length) {
+                    if (false) {
                         tape.push(0)
                     }
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  interpret_bf

[Timeout] StringLiteral
src/bf_interpreter.js:43:22
                         tape.push(0)
                     }
                     break;
-                case "<":
+                case "":
                     tape_pointer--;
                     if (tape_pointer < 0) {

[Timeout] ConditionalExpression
src/bf_interpreter.js:45:25
                     break;
                 case "<":
                     tape_pointer--;
-                    if (tape_pointer < 0) {
+                    if (true) {
                         tape.unshift(0);
                         tape_pointer = 0;

[Killed] ConditionalExpression
src/bf_interpreter.js:51:25
                     }
                     break;
                 case ",":
-                    if (input_pointer >= input.length) {
+                    if (true) {
                         tape[tape_pointer] = 0; // Return 0 for EOF
                     } else {
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js
  interpret_bf
    ✓ Blank program should output nothing (4 ms)
    ✓ Wrong-type input should throw an error (32 ms)

[Killed] ConditionalExpression
src/bf_interpreter.js:69:17
                         loop_stack.push(program_pointer);
                     }
                     break;
-                case "]":
-                    if(loop_stack.length) {
-                        if (tape[tape_pointer] != 0) {
-                            program_pointer = loop_stack.at(-1); //bc of for loop, actually jumps to instruction AFTER "["
-                        } else {
-                            loop_stack.pop();
-                        }
-                    } else {
-                        throw new Error("Mismatched right bracket at character "+(program_pointer+1)+".");
-                    }
-                    break;
+                case "]":
                 case undefined:
                     throw new Error("Undefined character. Program pointer likely exceeded program length.");
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  interpret_bf

[Killed] ConditionalExpression
src/bf_interpreter.js:70:24
                     }
                     break;
                 case "]":
-                    if(loop_stack.length) {
+                    if(true) {
                         if (tape[tape_pointer] != 0) {
                             program_pointer = loop_stack.at(-1); //bc of for loop, actually jumps to instruction AFTER "["
killedBy: All tests
statusReason: > cis-470_project@1.0.0 test
> jest --verbose --coverage


FAIL src/bf_interpreter.test.js

  interpret_bf

[Survived] ConditionalExpression
src/bf_interpreter.js:80:17
                         throw new Error("Mismatched right bracket at character "+(program_pointer+1)+".");
                     }
                     break;
-                case undefined:
-                    throw new Error("Undefined character. Program pointer likely exceeded program length.");
+                case undefined:
+// everything else is a comment
                 // everything else is a comment
             }
